#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```golang

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```golang

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.k3s-controlplane.digitalocean_droplet.opsdev will be created
  + resource "digitalocean_droplet" "opsdev" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-24-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k3s-controlplane"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sfo3"
      + resize_disk          = true
      + size                 = "basic-xs"
      + status               = (known after apply)
      + tags                 = [
          + "controlplane",
          + "do-droplet",
          + "k3s",
          + "k3s-controlplane",
          + "opentofu",
          + "sfo3",
          + "ubuntu-24-10-x64",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "fce3e29f-bc4d-4edd-b19e-1780919c67c9"
    }

  # module.k3s-controlplane.digitalocean_volume.opsdev will be created
  + resource "digitalocean_volume" "opsdev" {
      + description             = "Volume for k3s-controlplane"
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "k3s-controlplane"
      + region                  = "sfo3"
      + size                    = 50
      + tags                    = [
          + "controlplane",
          + "do-droplet",
          + "k3s",
          + "k3s-controlplane",
          + "opentofu",
          + "sfo3",
          + "ubuntu-24-10-x64",
        ]
      + urn                     = (known after apply)
    }

  # module.k3s-controlplane.digitalocean_volume_attachment.opsdev will be created
  + resource "digitalocean_volume_attachment" "opsdev" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + volume_id  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @TheOpsDev, Action: `pull_request`, Working Directory: `opentofu/digitalocean`, Workflow: `OpenTofu Comment PR`*